Tekla Open API Reference for Tekla Structures 2025
CustomBoolean Methods
The AssemblyFilterExpressions.CustomBoolean type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
AssemblyFilterExpressions.CustomBoolean Class
Tekla.Structures.Filtering.Categories Namespace